---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.HangerProfileNotMatchWithHost
source: html/ce6b029d-21a4-8359-0da2-bae90b08b1b7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.HangerProfileNotMatchWithHost Property

The defined hanger profile does not match with the host.

## Syntax (C#)
```csharp
public static FailureDefinitionId HangerProfileNotMatchWithHost { get; }
```